{
  "アラバマ州": "州都モンゴメリーは公民権運動の発祥の地とされる\\n1980年以降、大統領選挙では共和党の候補が勝利",
  "アラスカ州": "資源が豊富で州の経済活動の大半はエネルギー産業\\n大統領選挙16回のうち15回で、共和党候補が勝利",
  "アリゾナ州": "白人が人口の半分以上だが移民も多い\\n前回大統領選でバイデン氏が僅差で勝利",
  "アーカンソー州": "農業のほか養鶏業も盛ん。小売り大手の本社も\\n前回大統領選挙はトランプ氏圧勝など近年共和党優勢",
  "カリフォルニア州": "人口は全米で最多　ヒスパニック系40％など多様な人種\\n民主党の強力地盤で前回大統領選挙ではバイデン氏が圧勝",
  "コロラド州": "近年ハイテク産業や研究機関などの立地が進む\\n前回大統領選挙ではバイデン氏が勝利",
  "コネティカット州": "保険業盛ん　州都は「アメリカ保険の首都」とも呼ばれる\\n伝統的に民主党の地盤",
  "フロリダ州": "白人の富裕層の老後の移住先として人気\\n共和、民主の支持率きっ抗　20年はトランプ氏勝利",
  "ジョージア州": "州都アトランタには多くの大企業が本社\\n伝統的に共和党が強いが前回大統領選はバイデン氏勝利",
  "ハワイ州": "観光関連産業が盛んでコロナ影響受ける\\n民主党の地盤で、2年前はバイデン氏大差で勝利",
  "アイダホ州": "特産のジャガイモをはじめ農業が盛ん\\n伝統的に共和党の強固な支持基盤",
  "イリノイ州": "大都市シカゴを抱え中西部の金融や製造業の拠点\\n1992年以降大統領選挙では民主党候補が勝利",
  "アイオワ州": "トウモロコシや大豆の生産など農業が盛ん\\nスイング・ステートで過去2回はトランプ氏勝利",
  "カンザス州": "ことし8月に人工妊娠中絶を巡る住民投票で注目\\n1968年以降、共和党の候補者が勝利する強固な地盤",
  "ケンタッキー州": "自動車関連産業やたばこの生産が地域の主な産業\\n過去6回の大統領選挙では共和党候補が勝利",
  "ルイジアナ州": "ハリケーンによる被害多い。貧困率は全米で2番目高い\\n2000年以降、大統領選挙では共和党候補が勝利",
  "メリーランド州": "首都ワシントンに隣接するベッドタウン\\n伝統的に民主党強く前回大統領選挙でもバイデン氏勝利",
  "ミズーリ州": "トウモロコシや綿花栽培などのほか、ビールの生産などが盛ん\\nかつては共和・民主きっ抗も近年は共和党への支持が強い",
  "ネバダ州": "観光地・ラスベガスがあり、娯楽産業や観光業が盛ん\\n共和、民主の支持率がきっ抗し選挙のたびに接戦に",
  "ニューハンプシャー州": "アメリカ建国時の独立13州のうちの1つ\\nリベラルな土地柄で近年さらに民主党への支持強まる",
  "ニューヨーク州": "アメリカ最大の都市であるニューヨーク市を抱える\\n都市部を中心に伝統的に民主党の強固な地盤",
  "ノースカロライナ州": "最大都市シャーロットは全米指折りの金融都市\\n伝統的に共和党の強い保守地盤も激戦州として注目",
  "オハイオ州": "かつて重工業が盛んだった「ラストベルト」の一部\\n民主と共和の勢力がきっ抗し無党派層も多い",
  "オクラホマ州": "石油と天然ガスの生産量は国内有数　航空機産業も\\n大統領選挙では過去10回以上にわたり共和党が勝利",
  "オレゴン州": "太平洋に面し州のほぼ半分が森林で木材産業が盛ん\\nリベラルな気風　前回大統領選挙でもバイデン氏勝利",
  "ペンシルベニア州": "鉄鋼業や石炭産業が衰退した「ラストベルト」の1つ\\n16年にトランプ氏、20年にバイデン氏勝利し激戦州",
  "サウスカロライナ州": "キリスト教の伝統的価値観を重んじる保守派の強い地盤\\n20年の大統領選挙でトランプ氏が勝利",
  "サウスダコタ州": "ロッキー山脈の東側に位置し、農業や畜産業が盛ん\\n大統領選挙では1968年以降、共和党の候補者が勝利",
  "ユタ州": "キリスト教の一派のモルモン教徒が人口の約60％以上\\n大統領選挙では1968年以降、共和党の候補者が勝利",
  "バーモント州": "人口は65万人と全米で2番目に少ない州\\n1992年以降、8回の大統領選挙で民主党が勝利",
  "ワシントン州": "最大都市はシアトルで大手IT企業が本社を置く\\n大統領選挙では1988年以降、民主党の候補が勝利",
  "ウィスコンシン州": "「ラストベルト」と呼ばれる地域　農業も重要な産業\\n民主党の地盤とされてきたものの近年は勢力がきっ抗",
  "ノースダコタ州": "農業・畜産業が盛んなほかエネルギー産業が経済の中心\\n１９６８年以降の大統領選挙ですべて共和党が勝利",
  "インディアナ州": "主要な幹線道路が交わる「アメリカの十字路」\\n共和党の支持者多く前回大統領選でトランプ氏勝利"
}
